applications/test/coupledFvPatch/testFullMatching/ACMI/0.orig/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev.feature-ACMI                      |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   //uniform 0;
                nonuniform List<scalar> 2(33 44);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform 40.3333;    // linear interpolate to be
                                            // consistent with cyclic
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform 40.3333;
    }

    left1
    {
        type            zeroGradient;
    }
    "(walls.*)"
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    right2
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
