applications/test/coupledFvPatch/testFullMatching/ACMI/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication topoSet -constant

# split the mesh to generate the ACMI coupled patches
runApplication createBaffles -overwrite

# remove zero-sized patches
runApplication createPatch -overwrite

rm -rf 0 && cp -rf 0.orig 0

#------------------------------------------------------------------------------
